### import libraries

In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

### import dataset

In [4]:
data = pd.read_csv('house_price.csv')
x = data.iloc[:,:-1]
y = data.iloc[:,-1]

In [5]:
data.head()

   area  rooms   price
0  2104      3  399900
1  1600      3  329900
2  2400      3  369000
3  1416      2  232000
4  3000      4  539900

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   area    47 non-null     int64
 1   rooms   47 non-null     int64
 2   price   47 non-null     int64
dtypes: int64(3)
memory usage: 1.2 KB

In [7]:
data.describe()

              area      rooms          price
count    47.000000  47.000000      47.000000
mean   2000.680851   3.170213  340412.659574
std     794.702354   0.760982  125039.899586
min     852.000000   1.000000  169900.000000
25%    1432.000000   3.000000  249900.000000
50%    1888.000000   3.000000  299900.000000
75%    2269.000000   4.000000  384450.000000
max    4478.000000   5.000000  699900.000000

In [8]:
data.corr()

           area     rooms     price
area   1.000000  0.559967  0.854988
rooms  0.559967  1.000000  0.442261
price  0.854988  0.442261  1.000000

### splitting the dataset

In [46]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.2,random_state = 0)

In [47]:
x_train.shape

(37, 2)

In [48]:
y_train.shape

(37,)

### training the model

In [49]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()
reg.fit(x_train,y_train)

LinearRegression()

### prediction

In [50]:
y_pred = reg.predict(x_test)
np.set_printoptions(precision = 2)

In [51]:
print(y_pred,'\n\n',y_test)

[362648.19 480572.88 318812.02 461734.03 412525.32 337477.5  407239.48
 214817.9  287639.53 328329.36]

 28    475000
33    579900
30    349900
4     539900
18    499998
11    347000
42    314000
31    169900
22    242900
10    239999
Name: price, dtype: int64

### model coefficients and intercept

In [52]:
print('model coefficients : ',reg.coef_)
print('model intercepts : ',reg.intercept_)

model coefficients :  [  125.85 -1596.93]
model intercepts :  90561.37024100643

### single value prediction

In [53]:
price = reg.predict([[3000, 6]])
print(price)

[458540.16]

In [54]:
from sklearn.metrics import r2_score
acc = r2_score(y_test,y_pred)

In [55]:
acc*100

67.4551524993202